/**
 * НЕ ЗАБЫВАЙ ПИСАТЬ state# в начале значения !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 */
export const типыОбъектов = 'state#типыОбъектов'
export const праваПредоставляемыеПрофилем = 'state#праваПредоставляемыеПрофилем'
export const переченьСубъектовДоступаДопущенныхКРаботеНаАрм = 'state#переченьСубъектовДоступаДопущенныхКРаботеНаАрм'
export const переченьАрмВАс = 'state#переченьАрмВАс'
export const переченьСубьектовДоступаДопущенногоКРаботеВАс = 'state#переченьСубьектовДоступаДопущенногоКРаботеВАс'
export const разрешительнаяСистемаДоступаКРесурсам = 'state#разрешительнаяСистемаДоступаКРесурсам'
export const переченьРесурсовВАс = 'state#переченьРесурсовВАс'
export const заявкиНаОбработку = 'state#заявкиНаОбработку'
export const заявкиВыполненные = 'state#заявкиВыполненные'

export const действующиеРесурсыПользователя = 'state#действующиеРесурсыПользователя'
export const действующиеИНаЭтапеРегистрацииРесурсы = 'state#действующиеИНаЭтапеРегистрацииРесурсы'
export const действующиеРесурсы = 'state#действующиеРесурсы'
export const деревоРесурсов = 'state#деревоРесурсов'

export const действующиеПрофилиПользователя = 'state#действующиеПрофилиПользователя'
export const действующиеИНаЭтапеРегистрацииПрофили = 'state#действующиеИНаЭтапеРегистрацииПрофили'
export const существующиеПрофилиДляАдмина = 'state#существующиеПрофилиДляАдмина'
export const моиПрофили = 'state#моиПрофили'

export const главныеТипыОбъектов = 'state#главныеТипыОбъектов'
export const типыОбъектовСервисов = 'state#типыОбъектовСервисов'

export const оргЕдиницы = 'state#оргЕдиницы'

export const владельцыРесурсов = 'state#владельцыРесурсов'
export const типыСекретности = 'state#типыСекретности'
export const типыСервисов = 'state#типыСервисов'
export const всеСотрудникиДляФейкЮзера = 'state#всеСотрудникиДляФейкЮзера'
export const всеСотрудники = 'state#всеСотрудники'
export const всеФрагменты = 'state#всеФрагменты'
export const алерты = 'state#алерты'
