
export const всеМоиЗаявки = 'Все мои заявки'
export const моиВыполненныеЗаявки = 'Выполненные заявки'
export const моиЗаявкиНаРассмотрении = 'Заявки на рассмотрении'
export const яОтветственныйЗаРесурс = 'Ресурсы за которые отвечаю'
export const яВладелецРесурса = 'Ресурсы которыми владею'
export const моиПрофили = 'Мои профили'

export const переченьРесурсовВАс = 'Перечень ресурсов в АС'
export const переченьСубъектовДоступаДопущенногоКРаботеВАс = 'Перечень субъектов доступа (персонала), допущенных к работе в АС'
export const переченьАрмВАс = 'Перечень АРМ в АС'
export const переченьСубъектовДоступаДопущенныхКРаботеНаАрм = 'Перечень субъектов доступа, допущенных к работе на АРМ'
export const переченьРесурсовККоторымПредоставленДоступСубъектам = 'Перечень ресурсов, к которым предоставлен доступ субъектам (персоналу)'
export const разрешительнаяСистемаДоступаКРесурсам = 'Разрешительная система доступа к ресурсам (перечень всех ресурсов и допущенных к ним субъектов доступа)'
export const разрешительнаяСистемаДоступаКРесурсам2 = 'Разрешительная система доступа к ресурсам'
export const формаСозданияПользователя = 'Форма создания пользователя'
export const формаОбновленияФиоПользователя = 'Форма обновления ФИО пользователя'
export const формаСозданияФиоПользователя = 'Форма создания ФИО пользователя'
export const формаСозданияЛогинаПользователя = 'Форма создания логина пользователя'
export const формаЗаявкиПредоставленияСубьектамДоступаКРесурсу = 'Форма заявки предоставления субьектам доступа к ресурсу'
export const формаЗаявкиПредоставленияСубьектамДоступаКРесурсуЗЛИВС = 'Форма заявки предоставления субьектам доступа к ресурсу ЗЛИВС'
export const формаЗаявкиНаСозданиеИмениПрофиля = 'Форма заявки на создание имени профиля'
export const формаЗаявкиНаСозданиеРесурса = 'Форма заявки на создание ресурса'
export const формаЗаявкиНаСозданиеРесурсаЗЛИВС = 'Форма заявки на создание ресурса ЗЛИВС'
export const формаСозданияТройнойЗаявки = 'Форма создания тройной заявки'
export const формаДобавленияОбъектовВПрофиль = 'Форма добавления объектов в профиль'
export const формаСозданияПрофиля = 'Форма создания профиля'

// PRD
export const переченьРесурсовВАсPRD = 'Перечень ресурсов в АС (PRD)'
export const разрешительнаяСистемаДоступаКРесурсамPRD = 'Разрешительная система доступа к ресурсам (перечень всех ресурсов и допущенных к ним субъектов доступа) (PRD)'

// Для админов
export const очередьЗаявок = 'Очередь заявок'
export const заявкиНаСозданиеПрофиляНовые = 'Заявки на создание профиля (новые)'
export const новыеЗаявки = 'Новые заявки'
export const выполненныеЗаявки = 'Выполненные заявки'
export const заявкиНаСозданиеПрофиляВыполненные = 'Заявки на создание профиля (выполненные)'
// справочники
export const созданныеПрофили = 'Существующие профили'
export const созданныеРесурсы = 'Существующие ресурсы'

// @LABEL:CONSTANTS-TITLES@
