/*
// СОЗДАТЬ ИЛИ ПОЛУЧИТЬ - глагол в верхнем регистре

// Что будем получать или создавать - существительное
// например: действующие профили // каждое слово писать через пробел
// Перечень ресурсов в АС
переченьРесурсовВАс

// --------------------------------------------------------------------------------------------------------------
// getter-types.js
// --------------------------------------------------------------------------------------------------------------
import * as getterTypes from './getter-types'
export const получитьПереченьРесурсовВАс = 'получитьПереченьРесурсовВАс'

// --------------------------------------------------------------------------------------------------------------
// mutation-types.js
// --------------------------------------------------------------------------------------------------------------
import * as mutationTypes from './mutation-types'
export const СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС = 'СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС'

// --------------------------------------------------------------------------------------------------------------
// actions-types.js
// --------------------------------------------------------------------------------------------------------------
import * as actionTypes from './action-types'
export const СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС = 'СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС'

export const СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ = 'СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ'
export const ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА = 'ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА'

// --------------------------------------------------------------------------------------------------------------
// URL-TYPES
// --------------------------------------------------------------------------------------------------------------
import * as urlTypes from './url-types'
export const СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ = '/RequestAjax/GetAllResources'
export const ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА = '/RequestAjax/GetAllResources'

// --------------------------------------------------------------------------------------------------------------
// PARAM-TYPES
// --------------------------------------------------------------------------------------------------------------
import * as urlTypes from './params-types'
export class ПАРАМЕТРЫ_ЗАПРОСА_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС {
  /!**
   * @param {String}
   * @param {Number}
   * @param {Number}
   * @param {Number}
   * @param {Number}
   * @param {Number}
   *!/
  constructor (наДату, , , , ) {
    this.dateTime = наДату
    this. =
    this. =
    this. =
    this. =
  }
}

// --------------------------------------------------------------------------------------------------------------
// STORE.JS
// --------------------------------------------------------------------------------------------------------------

// state
переченьРесурсовВАс: [],

// getter
[getterTypes.получитьПереченьРесурсовВАс]: state => state.переченьРесурсовВАс,

// mutation
[mutationTypes.СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС] (state, value) {
  state.переченьРесурсовВАс = value
},

// Действия
// сохранить
[actionTypes.СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС] ({ commit }, value) {
  commit(mutationTypes.СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС, value)
}

// GET
// модель: модель - надо ввести слово "модель" без кавычек, либо значение null
/!**
 * @function dispatch
 * @param {Object.<ПАРАМЕТРЫ_ЗАПРОСА_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС>} модель
 * @returns {Promise}
 *!/
[actionTypes.ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА] ({ dispatch }, модель) {
  return dispatch(
    actionTypes.ВЫПОЛНИТЬ_ЗАПРОС_GET,
    new GetPayloadYesParam(
      urlTypes.ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА,
      модель,
      mutationTypes.СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС,
      actionTypes.ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА,
    ))
},

// Действия
// POST
/!**
 * @function dispatch
 * @param {Object.<ПАРАМЕТРЫ_ЗАПРОСА_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС>} модель
 * @returns {Promise}
 *!/
[actionTypes.СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ] ({ dispatch }, модель) {
  return dispatch(
    actionTypes.ВЫПОЛНИТЬ_ЗАПРОС_POST,
    new PostPayload(
      urlTypes.СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ,
      модель,
      actionTypes.СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ,
    ))
},

// --------------------------------------------------------------------------------------------------------------
// ДЛЯ КОМПОНЕНТА
// --------------------------------------------------------------------------------------------------------------
<script>
  import { mapActions, mapGetters, mapMutations } from 'vuex'

  import {
    получитьПереченьРесурсовВАс
  } from '../../store/getter-types'

  import {
    СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ
    ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА
  } from '../../store/action-types'

  import { СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС } from '../../store/mutation-types'
  import { ПАРАМЕТРЫ_ЗАПРОСА_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС } from '../../store/params-types'

  export default {

    data: () => ({
      выбранныйПереченьРесурсовВАс: null,
    }),

    computed: {
      ...mapGetters([
        получитьПереченьРесурсовВАс,
      ]),
    },

    methods: {
      СоздатьРесурс () {
        this.$store.dispatch(
            СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ
            ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА,
          new ПАРАМЕТРЫ_ЗАПРОСА_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС(
          ))
      },

      ...mapActions([
        СОЗДАТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_НА_СЕРВЕРЕ
        ПОЛУЧИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС_С_СЕРВЕРА,
      ]),

      ...mapMutations([
        СОХРАНИТЬ_ПЕРЕЧЕНЬ_РЕСУРСОВ_В_АС
      ]),
    },
  }
</script>

*/
