/*
// СОЗДАТЬ ИЛИ ПОЛУЧИТЬ - глагол в верхнем регистре

// Что будем получать или создавать - существительное
// например: действующие профили // каждое слово писать через пробел
// типыДобавляемыхОбъектов
типыДобавляемыхОбъектов

// --------------------------------------------------------------------------------------------------------------
// getter-types.js
// --------------------------------------------------------------------------------------------------------------
import * as getterTypes from './getter-types'
export const получитьТипыДобавляемыхОбъектов = 'получитьТипыДобавляемыхОбъектов'

// --------------------------------------------------------------------------------------------------------------
// mutation-types.js
// --------------------------------------------------------------------------------------------------------------
import * as mutationTypes from './mutation-types'
export const СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ = 'СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ'

// --------------------------------------------------------------------------------------------------------------
// actions-types.js
// --------------------------------------------------------------------------------------------------------------
import * as actionTypes from './action-types'
export const СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ = 'СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ'

export const СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ = 'СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ'
export const ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА = 'ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА'

// --------------------------------------------------------------------------------------------------------------
// URL-TYPES
// --------------------------------------------------------------------------------------------------------------
import * as urlTypes from './url-types'
export const СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ = '/RequestAjax/'
export const ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА = '/RequestAjax/'

// --------------------------------------------------------------------------------------------------------------
// PARAM-TYPES
// --------------------------------------------------------------------------------------------------------------
import * as urlTypes from './params-types'
export class ПАРАМЕТРЫ_ЗАПРОСА_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ {
  /!**
   * @param {String}
   * @param {Number}
   * @param {Number}
   * @param {Number}
   * @param {Number}
   * @param {Number}
   *!/
  constructor (, , , , ) {
    this. =
    this. =
    this. =
    this. =
    this. =
  }
}

// --------------------------------------------------------------------------------------------------------------
// STORE.JS
// --------------------------------------------------------------------------------------------------------------

// state
типыДобавляемыхОбъектов: [],

// getter
[getterTypes.получитьТипыДобавляемыхОбъектов]: state => state.типыДобавляемыхОбъектов,

// mutation
[mutationTypes.СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ] (state, value) {
  state.типыДобавляемыхОбъектов = value
},

// Действия
// сохранить
[actionTypes.СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ] ({ commit }, value) {
  commit(mutationTypes.СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ, value)
}

// GET
[actionTypes.ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА] ({ dispatch }, модель) {
  return dispatch(
    actionTypes.ВЫПОЛНИТЬ_ЗАПРОС_GET,
    new GetPayloadYesParam(
      urlTypes.ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА,
      модель,
      mutationTypes.СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ,
      actionTypes.ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА,
    ))
},

// Действия
// POST
[actionTypes.СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ] ({ dispatch }, модель) {
  return dispatch(
    actionTypes.ВЫПОЛНИТЬ_ЗАПРОС_POST,
    new PostPayload(
      urlTypes.СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ,
      модель,
      actionTypes.СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ,
    ))
},

// --------------------------------------------------------------------------------------------------------------
// ДЛЯ КОМПОНЕНТА
// --------------------------------------------------------------------------------------------------------------
<script>
  import { mapActions, mapGetters, mapMutations } from 'vuex'

  import {
    получитьТипыДобавляемыхОбъектов
  } from '../../store/getter-types'

  import {
    СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ
    ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА
  } from '../../store/action-types'

  import { СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ } from '../../store/mutation-types'
  import { ПАРАМЕТРЫ_ЗАПРОСА_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ } from '../../store/params-types'

  export default {

    data: () => ({
      выбранныйТипыДобавляемыхОбъектов: null,
    }),

    computed: {
      ...mapGetters([
        получитьТипыДобавляемыхОбъектов,
      ]),
    },

    methods: {
      СоздатьРесурс () {
        this.$store.dispatch(
            СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ
            ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА,
          new ПАРАМЕТРЫ_ЗАПРОСА_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ(
          ))
      },

      ...mapActions([
        СОЗДАТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_НА_СЕРВЕРЕ
        ПОЛУЧИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ_С_СЕРВЕРА,
      ]),

      ...mapMutations([
        СОХРАНИТЬ_ТИПЫ_ДОБАВЛЯЕМЫХ_ОБЪЕКТОВ
      ]),
    },
  }
</script>
*/
