//
/// / СОЗДАТЬ ИЛИ ПОЛУЧИТЬ - глагол в верхнем регистре
//
/// / Что будем получать или создавать - существительное
/// / например: действующие профили // каждое слово писать через пробел
/// / Разрешительная система доступа к ресурсам
// разрешительнаяСистемаДоступаКРесурсам
//
/// / --------------------------------------------------------------------------------------------------------------
/// / getter-types.js
/// / --------------------------------------------------------------------------------------------------------------
// import * as getterTypes from './getter-types'
//
// <@LABEL:GETTER@>
// export const получитьРазрешительнаяСистемаДоступаКРесурсам = 'получитьРазрешительнаяСистемаДоступаКРесурсам'
// </@LABEL:GETTER@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / mutation-types.js
/// / --------------------------------------------------------------------------------------------------------------
// import * as mutationTypes from './mutation-types'
//
// <@LABEL:MUTATION@>
// export const СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ = 'СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ'
// </@LABEL:MUTATION@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / actions-types.js
/// / --------------------------------------------------------------------------------------------------------------
// import * as actionTypes from './action-types'
//
/// / сохранить данные в хранилище (вызвать мутацию)
// <@LABEL:ACTION-COMMIT-REPORTS@>
// export const СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ = 'СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ'
// </@LABEL:ACTION-COMMIT-REPORTS@>
//
/// / получить с сервера отчет
// <@LABEL:ACTION-COMMIT-REPORTS@>
// export const ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА = 'ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА'
// </@LABEL:ACTION-COMMIT-REPORTS@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / URL-TYPES
/// / --------------------------------------------------------------------------------------------------------------
// import * as urlTypes from './url-types'
//
/// / отчеты
// <@LABEL:URL.GET-REPORTS@>
// export const ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА = '/ReportAjax/RSD'
// </@LABEL:URL.GET-REPORTS@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / Header-types | для отчетов
/// / --------------------------------------------------------------------------------------------------------------
// import * as urlTypes from './header-types'
// import * as _ from '../словарь'
//
// <@LABEL:HEADER@>
// export class РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ {
//  constructor () {
//    return [
//      {
//        text: _.Ин,
//        align: 'start',
//        value: 'id',
//      },
//      {
//        text: _.ИмяОбъектаРесурса,
//        value: 'object_type',
//      },
//      {
//        text: _.ИмяПрофиля,
//        value: 'profile_name',
//      },
//      {
//        text: _.СтруктурнаяЕдиница,
//        value: 'org_name',
//      },
//      {
//        text: _.Фио,
//        value: 'fio_full',
//      },
//      {
//        text: _.ТабельныйНомер,
//        value: 'tnum',
//      },
//      {
//        text: _.Должность,
//        value: 'job_name',
//      },
//      {
//        text: _.Логин,
//        value: 'login',
//      },
//      {
//        text: _.ФормаДопуска,
//        value: 'form_perm',
//      },
//      {
//        text: _.ДатаПредоставленияДоступа,
//        value: 'request_allow_date',
//      },
//      {
//        text: _.ДатаПрекращенияДоступа,
//        value: 'request_deny_date',
//      },
//    ]
//  }
// }
// </@LABEL:HEADER@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / PARAM-TYPES
/// / --------------------------------------------------------------------------------------------------------------
//
// import * as urlTypes from './param-types'
//
// <@LABEL:PARAM@>
// export class ПАРАМЕТРЫ_ЗАПРОСА_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ {
//	// eslint-disable-next-line no-tabs
//	// eslint-disable-next-line no-tabs
//	// eslint-disable-next-line no-tabs
//	/!**
//	 * @param {String}
//	 * @param {Number}
//	 * @param {Number}
//	 * @param {Number}
//	 * @param {Number}
//	 * @param {Number}
//	 *!/
//	constructor (, , , , ) {
//		this. =
//		this. =
//		this. =
//		this. =
//		this. =
//	}
// }
// </@LABEL:PARAM@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / RSD
/// / routePathConstName: RSD // пример: AcAccess
/// / routePathConstName2: rsd
/// / viewsSubFolder: Reports // ex: Reports
//
//  route.js:
// <@LABEL:ROUTER-OPERATOR-REPORTS@>
// {
//  path: 'rsd',
//  name: pathNames.RSD,
//  components: {
//    mainContent: () => import('../src/views/Reports/RSD'),
//  },
// },
// </@LABEL:ROUTER-OPERATOR-REPORTS@>
//
// в меню выбора отчета:
// \src\views\Operator\Reports.vue:
// <@LABEL:VIEWS-OPERATOR-REPORTS@>
// {
//  title: _.разрешительнаяСистемаДоступаКРесурсам,
//  to: { name: pathNames.RSD },
// },
// </@LABEL:VIEWS-OPERATOR-REPORTS@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / constants/path-names.js
/// / --------------------------------------------------------------------------------------------------------------
// <@LABEL:CONSTANTS-PATH-NAMES@>
// export const RSD = 'RSD'
// </@LABEL:CONSTANTS-PATH-NAMES@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / constants/titles.js
/// / --------------------------------------------------------------------------------------------------------------
/// / пример: export const переченьРесурсовВАс = 'Перечень ресурсов в АС'
// <@LABEL:CONSTANTS-TITLES@>
// export const разрешительнаяСистемаДоступаКРесурсам = 'Разрешительная система доступа к ресурсам'
// </@LABEL:CONSTANTS-TITLES@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / STORE.JS
/// / --------------------------------------------------------------------------------------------------------------
//
/// / state
/// / сущности
// <@LABEL:STORE.STATE-ENTITIES@>
// разрешительнаяСистемаДоступаКРесурсам: [],
// </@LABEL:STORE.STATE-ENTITIES@>
//
/// / отчёты
// <@LABEL:STORE.STATE-REPORTS@>
// разрешительнаяСистемаДоступаКРесурсам: [],
// </@LABEL:STORE.STATE-REPORTS@>
//
/// / getter
/// / отчёты
// <@LABEL:STORE.GETTERS-REPORTS@>
// [getterTypes.получитьРазрешительнаяСистемаДоступаКРесурсам]: state => state.разрешительнаяСистемаДоступаКРесурсам,
// </@LABEL:STORE.GETTERS-REPORTS@>
//
/// / mutation
/// / отчёты
// <@LABEL:STORE.MUTATION-REPORTS@>
// [mutationTypes.СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ] (state, value) {
//  state.разрешительнаяСистемаДоступаКРесурсам = value
// },
// </@LABEL:STORE.MUTATION-REPORTS@>
//
/// / Действия
/// / сохранить
/// /отчёты
// <@LABEL:STORE.ACTIONS-COMMIT-REPORTS@>
// [actionTypes.СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ] ({ commit }, value) {
//  commit(mutationTypes.СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ, value)
// },
// </@LABEL:STORE.ACTIONS-COMMIT-REPORTS@>
//
/// / GET
/// / модель, наДату, null: наДату - надо ввести слово,
/// / для отчётов
// <@LABEL:STORE.ACTIONS-GET-REPORTS@>
/// !**
// @function dispatch
// @param {Object.<ПАРАМЕТРЫ_ЗАПРОСА_НА_ДАТУРАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ>} модель
// @returns {Promise, Array<РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ>}
//! /
// [actionTypes.ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА] ({ dispatch }, наДату) {
//  return dispatch(
//    actionTypes.ВЫПОЛНИТЬ_ЗАПРОС_GET,
//    new GetPayloadYesParam(
//      urlTypes.ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА,
//      наДату,
//      mutationTypes.СОХРАНИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ,
//      actionTypes.ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА,
//    ))
// },
// </@LABEL:STORE.ACTIONS-GET-REPORTS@>
//
/// / --------------------------------------------------------------------------------------------------------------
/// / ДЛЯ КОМПОНЕНТА
/// / --------------------------------------------------------------------------------------------------------------
/// / данные будут вставлены в начало созданного файла
// <@LABEL:VUE-COMPONENT@>
// <script>
//  import { mapActions, mapGetters } from 'vuex'
//
//  import {
//    получитьРазрешительнаяСистемаДоступаКРесурсам
//  } from '../../store/getter-types'
//
//  import {
//    ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА
//  } from '../../store/action-types'
//
//  // для отчётов
//  import { разрешительнаяСистемаДоступаКРесурсам } from '../../constants/titles'
//  import { РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ as Header } from '../../store/header-types'
//
//  оставить нужную строку
//  import { ПАРАМЕТРЫ_ЗАПРОСА_НА_ДАТУ } from '../../store/param-types'
//  import { ПАРАМЕТРЫ_ЗАПРОСА_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ } from '../../store/param-types'
//
//  export default {
//
//    // для отчётов
//    data: () => ({
//      title: разрешительнаяСистемаДоступаКРесурсам,
//      headers: [],
//      строкаПоиска: '',
//      date: new Date().toISOString().substr(0, 10),
//    }),
//
//    computed: {
//      ...mapGetters([
//        получитьРазрешительнаяСистемаДоступаКРесурсам,
//      ]),
//    },
//
//    methods: {
//      // для отчетов
//      save (date) {
//        this.$refs.menu.save(date)
//      },
//
//      ...mapActions([
//        ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА,
//      ]),
//    },
//
//    created () {
//      this.headers = new Header()
//      this.ПОЛУЧИТЬ_РАЗРЕШИТЕЛЬНАЯ_СИСТЕМА_ДОСТУПА_К_РЕСУРСАМ_С_СЕРВЕРА(
//        new ПАРАМЕТРЫ_ЗАПРОСА_НА_ДАТУ('2019-07-07'),
//      )
//    },
//  }
// </script>
// </@LABEL:VUE-COMPONENT@>
